biddr_api/app/views/auctions/show.html.erb

            <h5 style="text-decoration: underline;">Previous Bids</h5>
            <% @auction.bids.each do |bid| %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 3]]