biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        @auctions = Auction.all.order(created_at: :desc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @auction = Auction.find(params[:id])

INSERT INTO "auctions" ("title", "description", "ends_at", "reserve_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @new_auction = Auction.new params.require(:auction).permit(:title, :description, :ends_at, :reserve_price)
        if @new_auction.save