biddr_api/app/controllers/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def create
       @auction = Auction.find params[:auction_id]